{
  "pools": [
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "weight": 1,
          "functions": [
            {
              "function": "set_book_contents",
              "title": "",
              "author": "The Coven of Tomes",
              "pages": [
                "§1Magick can be used to accomplish alot of things, one of which is teleportation. By now, we've seen the various Ender spells witches have come up with to make traveling more efficient. However,",
                "§1while they do work, they are not the most efficient modes of travel. This is where §5Warping§1 and §5Faery Rings§1 come in. We will be looking at each of these methods of magickal transportation.",
                "§1[§5Warping§1]\n\n§5Primal Magick is a highlight of all circles of Magick within Bewitchery. Warping is no different. However, warping isn't as difficult as it seems. What is most important is the process.",
                "§5A Witch can have only five (5) Warp Points at any time, each connected to a different Primal Element. §1Witches cannot create the Warp Point of an Element they are not attuned to.§5 Setting a warp requires these two steps:",
                "§51) Ensure you are sneaking over the desired spot\n2)Use the following items in this sequence: (Ender Crystal > Ender Compass > Any Primal Crystal)",
                "§5Now that you've set a Warp Point, you can return to it by doing §1standing§5 and doing step 2. §1Ensure you use the same Primal Crystal.§5\n\nTravelling this way costs §21 level§5 so be aware.",
                "§1[§5Faery Rings§1]\n\n§5The Warp spell is cool and useful but sometimes, more stationary modes of transport are best. This is what Faery Rings provide. They can be used to transport anyone who uses",
                "§5an Amethyst Dust in the center to the location that it is set to. This capability leads to them being used to create teleportation stations and the like.",
                "§5Creating a Faery Ring is easy.\n\nYou simply sneak and use a §dWarp Gem§5 to record the location. Head to the desired 4x4 mushroom ring, and while standing, use it again in the center of the ring.",
                "§5An activated Faery Ring will have some portal particles rising slowly all across the area within the mushroom ring. §dTo create a Faery Ring, 5% of a Witch's Ender Affinity will be consumed so beware.",
                "§5If you record a location in the Warp Gem, it is advised NOT to go through any Faery Rings until you have used it (the Warp Gem) to create another Faery Ring. Travelling through a Faery Ring while having a location recorded will",
                "§5erase the location that was stored, which may lead to the Witch getting stranded. If the location's distance is far away, use the Warp spell instead. This does not have the same problem with locations recorded by the Warp Gem.",
                "§1[Other Tips]\n\n1) Warps are private. They are different based on the individual and where they set them.\n2) Faery Rings are public. Anyone with Amethyst Dust can use them to go to the location it has been bound to.",
                "§13) Breaking any of the mushrooms in a Faery Ring will break it.\n4) Faery Rings teleport almost everything inside the ring at a time.\n5) Faery Warps are nameable!\n6) Warps are recorded in the Grimoire.",
                "§1As we close this tome, we hope you have at least an idea of how useful this Advanced Ender Magick is. May the Elements be with you and may the Void guide your journeys."
              ]
            },
            {
              "function": "set_name",
              "name": "§r§fWarping for Novices§r"
            }
          ]
        }
      ]
    }
  ]
}