{
  "pools": [
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "weight": 1,
          "functions": [
            {
              "function": "set_book_contents",
              "title": "",
              "author": "The Coven of Tomes",
              "pages": [
                "§1 If you've crafted this book to become 'overpowered', kindly burn it. This was most certainly not our intention and we'd dislike to know our knowledge is being used in such a simplistic and crude way. However, if you've crafted it with the intention of§r",
                "§1exploring the magick of the world and empowering yourself with it, stay and absorb the knowledge that we will grant you.\n  There are many mystical disciplines across the worlds but this series will only cover one; Bewitchery. Users of this mystical",
                "§1art are called §2Witches§1, regardless of their gender. Witches use their knowledge to manipulate the natural resources and magicks of the various worlds to craft magickal potions, rituals and effects.",
                "§1[The Basics]\n\nA witch is a powerful person on their own but it isn't wrong to say that they are nothing without their various potions and components. For this, you will require three (3) things; a §2Brewing Stand§1, a §2Witch's Altar§1 and an",
                "§1adventuring spirit. A Witch's Altar is used to craft all sorts of necessary potion ingredients, ritual materials and spell components. The Brewing Stand is used to brew vial potions, ritual elixirs and a variety of infusions and an adventuring spirit",
                "§1is needed for exploring the worlds in search of important variables necessary for Bewitchery.\n In this series of books, we will go over various aspects of the Art in comprehensive tidbits, from the more accepted areas to the more obscure and strange",
                "§1bits. As we of the Coven of Tomes say, knowledge is only as dangerous as the mind that holds it.",
                "§1[The Journey]\n\n As was mentioned in little detail before, this book is simply the first of a series of scholarly books on the art of Bewitchery. Over the course of these books, you will learn how to brew new",
                "§1concoctions, set up and perform various rites & rituals, and perform magickal spells (in the right conditions and out of them). They should be read in the following order:",
                "§11) Bewitched Brews\n2) Rites & Rituals of the Mystics\n3) Primal Energies & You",
                "§1Another note to beginner witches; watch for Hedge Witches. Although their magickal prowess may not be much, they do trade various items a witch may need along their journey.",
                "§1PS: If you require the more fiery resources of the Nether, you may wish to consider §4Infernal Rituals§1."
              ]
            },
            {
              "function": "set_name",
              "name": "§r§f[#1] Beginning the Journey§r"
            }
          ]
        }
      ]
    }
  ]
}