{
  "pools": [
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "weight": 1,
          "functions": [
            {
              "function": "set_book_contents",
              "title": "",
              "author": "The Coven of Souls",
              "pages": [
                "§1 As the practice of Bewitchery grows across the Worlds, one thing remains a peculiarity; the Sculk. This strange existence is seen as the infestation of alien... §othings§r§1 that seems to have originated within the Deep Dark.",
                "§1 However, we, the Coven of Souls, see this as an opportunity. Through vigorous testing and §omany§r§1 unfortunate, but necessary, sacrifices, we have formulated a method to its strange madness.",
                "§1The Echo Shard Wand||\n\nThis magical instrument picks up the magical vibrations of specially constructed journals and tomes when placed in the first five (5) slots of the Ender Chest.",
                "§1Casting spells through the Echo Shard Wand requires §2Echo Shards to be in the hotbar (placement doesn't matter)§1. These Shards are consumed one by one on each successful cast.",
                "§1Care should be taken with the use of this wand though. On each successful spell, there is a chance that sculk will spread and infect the immediate area.",
                "§1Hexes and Curses||\n\n As we looked deeper into the dark, we realized that all spells derived from the Sculk are negative by nature. As such, we have taken to calling them §5Dark Spells§1.",
                "§1The following pages contain information on very dangerous spells. They may not be very damaging but some can cause serious injury.",
                "§0Blindness||\n\nThis spell conjures a black, sticky projectile that blinds the victim for a short duration.",
                "§0Withering||\n\nThis spell magically withers whatever it hits if they don't have an immunity to the Wither effect.",
                "§0True Darkness||\n\nAn area-of-effect spell that afflicts its victims with the Darkness and Blindness effects both.",
                "§0Bad Luck||\n\nA spell that seems to pass on the Bad Luck effect. However, we have reason to believe it might be more than a simple hex...",
                "§0Fatigue||\n\nA spell that afflicts the victim with Mining Fatigue. Used in the right circumstances, it can be deadly.",
                "§0Item Repulsion||\n\nA curse that causes items around the victim to move away from them. There are still ways to pick them up but it still serves as an annoyance.",
                "§0Fading Light||\n\nA curse that randomly gives the victim the Darkness effect. While this may seem harmless, it can make combat quite difficult.",
                "§0Halted Vitality||\n\nA very dangerous curse that makes the victim to immune to the Regeneration effect.",
                "§0Lunar Binding||\n\nA curse that binds the victim to their physical form. They are barred from being a §2spectator§0 and will immediately return to survival.",
                "§0Talisman Binding||\n\nA strange curse for us Archivists of the Coven of Souls. It completely binds the effects of talismans on the victim. Quite troublesome...",
                "§0Primal Binding||\n\nA troublesome curse that prevents Witches from using crystals to cast spells. Thankfully, scrolls are not affected. Apparently, Tomemancers are also affected by this curse.",
                "§0This effect indicates that the Sculk can block access to various forms of ancient magick...",
                "§0Hydrophobia||\n\nA curse similar to the condition that afflicts the Endermen. The victim takes damage from being in contact with water. Thankfully, this does not include rain.",
                "§0Psychosis||\n\nA curse that took a while to observe. According to the data collected, the victim hears a ghastly scream before being injured by nothing at all.",
                "§0This effect occurs randomly for the curse's duration and there have been records of it leading to death.",
                "§0Sonic Blast||\n\nA simple but powerful spell that blasts the target with a sonic attack. It closely resembles the shriek of the Sculk Shrieker.",
                "§0Famine||\n\nA seemingly harmless curse that randomly causes the victim to become afflicted with the Hunger effect.",
                "§1All the spells that have been marked as §0Curses§1 last a duration of three (3) Minecraft Days. Our data fails to give us a reason for this.",
                "§1Sculk Rituals||\n\nWe have found a way to magically induce sculk and transmute it in a controlled environment. In this way, we have learned how to magically produce Echo Shards.",
                "§1|Call of the Deep Dark|\n\nRitual Sequence:\n1) Elixir of the Forest\n2) Soul Fragment\n3) Nether Wart\n\nXP Cost: 8 XP Levels\n\nRitual Pattern:\nRemus' Transmogrification",
                "§1Transmutes Deepslate into Sculk and Reinforced Deepslate into Sculk Catalysts.",
                "§1|Crystallize Sculk|\n\nRitual Sequence:\n1) Elixir of the Forest\n2) Iron Pickaxe\n3) Natural Ash\n\nXP Cost: 6 XP Levels\n\nRitual Pattern:\nRemus' Transmogrification",
                "§1Transmutes Sculk back into Deepslate but has a chance of dropping Echo Shards as a result.",
                "§1Potions||\n\nDue to the modern nature of this study, the potions brewed from Sculk materials are crafted with the Brewing Stand.",
                "§1A Sculk Vial can be crafted by §2brewing an Echo Shard into Contained Void§1. This potion gives the Darkness effect when consumed but that not its only use. By §2brewing a Soul Fragment into it",
                "§2a Witch can brew a Vial o' Experience§1. This item gives a considerable amount of experience when consumed.",
                "§1The Deep Dark and what lies within it is almost complete mystery to us but we hope that, with this information, we've shed a little light unto the strange beings down there and how they connect to our magick."
              ]
            },
            {
              "function": "set_name",
              "name": "§r§fThe Magickal Mysteries of the Sculk§r"
            }
          ]
        }
      ]
    }
  ]
}