{
  "pools": [
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "weight": 1,
          "functions": [
            {
              "function": "set_book_contents",
              "title": "",
              "author": "Dwhyles859",
              "pages": [
                "Outside of Alchemy, most forms of magick will need the witch to pull from the Wylde. After all, a witch has no inherent magickal power, but this makes them exceptional at channeling it.",
                "However, the Wylde §owill§r pull back. As this pull increases, it becomes §5Magickal Fatigue§r. If you pull too much, the Wylde will pull back just as hard and this can cause problems.",
                "§mStages of Mag. Fatigue§r\n75% & Greater -  Slowed and Weakened\n85% & Greater - Vision shakes\n100% & Greater - Visual and auditory hallucinations\n130% & Greater - Death",
                "Performing magick that kills you cancels whatever it is you were doing. Luckily, the more you use magick, the better your tolerance to this pull will become. Fatigue Tolerance can be seen in the Crystal Ball.",
                "A witch's tolerance of the Wylde has 13 levels, all increasing the amount of Magickal Fatigue they can handle by a little. If you need any more than this, there have been ways to reduce Fatigue Cost in the past...",
                "§cYour limits are yours to figure out§r. Most magickal operations list their Fatigue Cost (FC) as either Low, Medium, or High. Low is anything below 15 FC. Medium is anything from 16 - 30 FC, and High means anything higher than 30 FC.",
                "Don't be alarmed though. Magickal Fatigue goes down by 1 every 3 seconds while awake and is reset to 0 with some rest. There has even been talk about solutions to be found through Alchemy."
              ]
            },
            {
              "function": "set_name",
              "name": "§r§fFatal Fatigue§r"
            }
          ]
        }
      ]
    }
  ]
}